tests/production/load-test.yml
# Artillery Load Test Configuration
# ═══════════════════════════════════════════════════════════════════════════════
# Usage:
#   npm install -g artillery
#   artillery run tests/production/load-test.yml
#
# Or with npx:
#   npx artillery run tests/production/load-test.yml
# ═══════════════════════════════════════════════════════════════════════════════

config:
  target: 'http://localhost:3000'
  phases:
    # Phase 1: Warm-up — light traffic
    - duration: 60
      arrivalRate: 10
      name: "Warm-up (10 req/s)"
    # Phase 2: Ramp up — moderate traffic
    - duration: 120
      arrivalRate: 50
      name: "Ramp up (50 req/s)"
    # Phase 3: Peak load — high traffic
    - duration: 60
      arrivalRate: 100
      name: "Peak load (100 req/s)"
  
  # Default headers
  defaults:
    headers:
      Content-Type: 'application/json'
  
  # Plugins
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 2000
        - http.response_time.p95: 1000
      conditions:
        - expression: http.codes.5xx > 1
          strict: false
          exit: true
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: 'Health Check'
    weight: 30
    requests:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200
            - contentType: json

  - name: 'API Version'
    weight: 30
    requests:
      - get:
          url: '/api/version'
          expect:
            - statusCode: 200
            - contentType: json

  - name: 'Main Page'
    weight: 20
    requests:
      - get:
          url: '/'
          expect:
            - statusCode: 200
            - contentType: html

  - name: 'Login Page'
    weight: 20
    requests:
      - get:
          url: '/login'
          expect:
            - statusCode: 200
            - contentType: html